app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`) VALUES('juanlove', 'juanms88@gmail.com', '8f52bdb0469d313d3b0e0de85a7daca577b0d7e4bed33ad0b03ad6b71442c58cc6eb363c020cf13109f8b3b503b3cb411524ade0cb93c1e7f20ac7850fff02e3', 'oy_0LeLjIF8tSw-MNbJU', 'ee0936000341368bbbbb9e0658ec7829a2b6c4864a5afceb1f2826fc0b29b65027af87c032eec22899df99b9e2a2af1e614fb47577158c29c41d64f6f49146af', '2010-03-02 23:03:49', '2010-03-02 23:03:49')
---
  def create
    @user = User.new(params[:user])
    if @user.save